zup/ЗУП_бюджет/src/Reports/Форма14МО/Форма14МО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Форма14МО</name>
</mdclass:Report>

zup/ЗУП_бюджет/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатВТомЧислеЗаСчетФБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВЧасах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыНорма</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксСтрока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксРасчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксСторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяБазаЗаЕдиницуНормыВремени</name>
    <comment>Расчетная база на единицу нормы времени для расчета сторно-записей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрацииВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрацииНормыВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <comment>Документ, который зарегистрировал сторнируемое начисление</comment>
    <type>
      <types>DefinedType.СторнируемыйДокумент</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийГрафик</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СторноТекущегоПериода</name>
    <type>
      <types>DefinedType.ДокументИсправляемыйВТекущемПериоде</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

zup/ЗУП_бюджет/src/AccumulationRegisters/НачисленияУдержанияПоСотрудникам/НачисленияУдержанияПоСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияУдержанияПоСотрудникам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОплаченоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОплаченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияВыполненияРаботВОрганизации</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <comment>для строк НДФЛ</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВзыскания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовССотрудниками</types>
      <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
      <types>ChartOfCalculationTypesRef.Начисления</types>
      <types>ChartOfCalculationTypesRef.Удержания</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов/СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов</name>
  <resources>
    <name>СтрокаОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов</name>
    <type>
      <types>CatalogRef.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейГосударственнойСлужбы/СвойстваДолжностейГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваДолжностейГосударственнойСлужбы</name>
  <resources>
    <name>ВидДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ВидыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.КатегорииДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ГруппыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюГосударственнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПомощникаЗамещающегоМуниципальнуюДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюВоеннойПравоохранительнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурораСледователяСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсчислениеСтраховогоСтажаПФРГосударственнойДолжности</name>
    <type>
      <types>CatalogRef.ЗамещениеГосударственныхМуниципальныхДолжностейПФР</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваНачисленийГосударственныхСлужащих/СвойстваНачисленийГосударственныхСлужащих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваНачисленийГосударственныхСлужащих</name>
  <resources>
    <name>ЯвляетсяДенежнымСодержанием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКДенежномуСодержанию</name>
    <type>
      <types>EnumRef.ОтношениеНачисленийКДенежномуСодержанию</types>
    </type>
  </resources>
  <resources>
    <name>УчетПриРасчетеОтпуска</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>УчетПриРасчетеСохраняемогоДенежногоСодержания</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>УчетВКомпенсацииПриУвольнении</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДенежнымДовольствием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКДенежномуДовольствию</name>
    <type>
      <types>EnumRef.ОтношениеНачисленийКДенежномуДовольствию</types>
    </type>
  </resources>
  <resources>
    <name>ВходитВРасчетПособияПоУходуЗаРебенкомВоеннослужащим</name>
    <type>
      <types>EnumRef.ПорядокВхожденияВРасчетПособияПоУходуЗаРебенкомВоеннослужащим</types>
    </type>
  </resources>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/ВидыДоговоровССотрудниками/ВидыДоговоровССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровССотрудниками</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонтрактГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоговорМуниципальногоСлужащего</name>
  </enumValues>
  <enumValues>
    <name>КонтрактВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ВоеннослужащийПоПризыву</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ГруппыДолжностейГосударственнойСлужбы/ГруппыДолжностейГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыДолжностейГосударственнойСлужбы</name>
  <enumValues>
    <name>Высшие</name>
  </enumValues>
  <enumValues>
    <name>Главные</name>
  </enumValues>
  <enumValues>
    <name>Ведущие</name>
  </enumValues>
  <enumValues>
    <name>Старшие</name>
  </enumValues>
  <enumValues>
    <name>Младшие</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Reports/Форма14МО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует табличный документ отчет.
//
// Параметры:
//  ТаблицаОтчета 	- ТабличныйДокумент - документ, в который выводятся данные.
//  Организация  	- СправочникСсылка.Организации - Организация, по которой формируется отчет.
//  ДатаНачала		- Дата - дата начала периода.
//  ДатаОкончания	- Дата - дата конца периода.
//
Процедура СформироватьОтчет(ТаблицаОтчета,Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	ТаблицаОтчета.Очистить();
			
	СформироватьОтчетФорма14МО(ТаблицаОтчета, Организация, ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРаздел(ТабДокРезультат, ВыборкаСтрок, ТекущийРаздел, ТочностьПоказателей, Макет) Экспорт
	
	ТочностьВ10 = Pow(10, ТочностьПоказателей);
	БоковикПоказатели = Макет.ПолучитьОбласть("Раздел_"+ТекущийРаздел+"|Боковик");
	ОбластьПоказатели = Макет.ПолучитьОбласть("Раздел_"+ТекущийРаздел+"|Всего");
	БоковикШапка	  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|Бюдж");
	ШапкаАналитики	  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|ПоРазделам");
	ШапкаВсего		  = Макет.ПолучитьОбласть("Св_"+ТекущийРаздел+"|ВСего");
	Шапка		  = Макет.ПолучитьОбласть("Шапка_"+ТекущийРаздел);
	
	ТабДокРезультат.Вывести(Шапка);
	
	ТабДокументШапка      = Новый ТабличныйДокумент;
	ДетальныеПоказатели   = Новый ТабличныйДокумент;
	
	ТабДокументШапка.Вывести(БоковикШапка);
	
	ИтогоСтруктураПараметров = ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели);
	СтруктураПараметровЗнач = ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели);

	Пока ВыборкаСтрок.Следующий() Цикл //Цикл по разделам отчета
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровЗнач, ВыборкаСтрок);
		Для каждого Параметр Из ИтогоСтруктураПараметров Цикл
			СтруктураПараметровЗнач[Параметр.Ключ]  = ?(СтруктураПараметровЗнач[Параметр.Ключ] = NULL, 0, СтруктураПараметровЗнач[Параметр.Ключ])/ТочностьВ10;
			ИтогоСтруктураПараметров[Параметр.Ключ] = ИтогоСтруктураПараметров[Параметр.Ключ] + СтруктураПараметровЗнач[Параметр.Ключ];
		КонецЦикла;
		ШапкаАналитики.Параметры.Заполнить(ВыборкаСтрок);
		ТабДокументШапка.Присоединить(ШапкаАналитики);
		
	КонецЦикла;	
		
	ТабДокРезультат.Вывести(ТабДокументШапка);
	ТабДокРезультат.Вывести(БоковикПоказатели);
	ОбластьПоказатели.Параметры.Заполнить(ИтогоСтруктураПараметров);
	ТабДокРезультат.Присоединить(ОбластьПоказатели);
	
	ВыборкаСтрок.Сбросить();
	Пока ВыборкаСтрок.Следующий() Цикл //Цикл по разделам отчета
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровЗнач, ВыборкаСтрок);
		Для каждого Параметр Из ИтогоСтруктураПараметров Цикл
			СтруктураПараметровЗнач[Параметр.Ключ]  = СтруктураПараметровЗнач[Параметр.Ключ]/ТочностьВ10;
		КонецЦикла;
		ОбластьПоказатели.Параметры.Заполнить(СтруктураПараметровЗнач);
		ТабДокРезультат.Присоединить(ОбластьПоказатели);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьНазваниеПараметровОбласти(ОбластьПоказатели)
	СтруктураПоказателей = Новый Структура;
	Для НомерСтроки = 1 По ОбластьПоказатели.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ОбластьПоказатели.ШиринаТаблицы Цикл
			Ячейка = ОбластьПоказатели.Область(НомерСтроки,НомерКолонки,НомерСтроки,НомерКолонки);
			Если Ячейка.Параметр <> "" И Ячейка.Параметр <> Неопределено Тогда
				Если НЕ СтруктураПоказателей.Свойство(Ячейка.Параметр) Тогда
					СтруктураПоказателей.Вставить(Ячейка.Параметр, 0);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат СтруктураПоказателей;
КонецФункции

Функция ДатаПереходаНа179н() Экспорт
	Возврат КонецГода('20101231235959')
КонецФункции

Функция ДатаПереходаНа143н() Экспорт
	Возврат КонецГода('20141231235959')
КонецФункции

Функция ДатаПереходаНа86н() Экспорт
	Возврат Дата(2016,1,1)
КонецФункции

Функция ДатаПереходаНа259н() Экспорт
	Возврат Дата(2017,1,1)
КонецФункции

Функция ПолучитьДанныеПоФорме14МОРасходы(Организация, ДатаНачала, ДатаОкончания) экспорт
	
	СтруктураДанных = Новый Структура("Расходы, Справка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация 		= Организация;
	ПараметрыПолученияСотрудников.НачалоПериода 	= ДатаНачала;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= ДатаОкончания;
			
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
			Запрос.МенеджерВременныхТаблиц, Истина, 
			ПараметрыПолученияСотрудников, 
			"ВТСотрудникиОрганизации");
			
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
	КадровыеДанные = "ВидДоговора";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);			
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
		
	// начисления, которые показываются в отчетах в составе других начислений
	МассивВРДляРаспределения = Новый Массив;
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеРайонныйКоэффициент());
	МассивВРДляРаспределения.Добавить(РасчетЗарплаты.НачислениеСевернаяНадбавка());
	Запрос.УстановитьПараметр("МассивВРДляРаспределения", МассивВРДляРаспределения);
	
	МассивВидыДоговоров = Новый Массив;
	МассивВидыДоговоров.Добавить(Перечисления.ВидыДоговоровССотрудниками.ДоговорМуниципальногоСлужащего);
	Запрос.УстановитьПараметр("МассивВидыДоговоров", МассивВидыДоговоров);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("парамИзмерения", Измерения);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	Разрезы.Добавить("ВидРасчета");
	Разрезы.Добавить("ПериодРегистрации");
	Запрос.УстановитьПараметр("парамРазрезы", Разрезы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияБазаНачисления.Сотрудник КАК Сотрудник,
	|	НачисленияБазаНачисления.ПериодРегистрацииРазрез КАК Период,
	|	НачисленияБазаНачисления.РегистраторРазрез КАК Регистратор,
	|	НачисленияБазаНачисления.ВидРасчетаРазрез КАК ВидРасчета,
	|	НачисленияБазаНачисления.РезультатБаза КАК Результат,
	|	НачисленияБазаНачисления.ПериодРегистрации КАК ПериодВР,
	|	НачисленияБазаНачисления.Регистратор КАК РегистраторВР,
	|	НачисленияБазаНачисления.ВидРасчета КАК ВидРасчетаВР,
	|	НачисленияБазаНачисления.Результат КАК РезультатВР,
	|	НачисленияБазаНачисления.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТВРДляРаспределения
	|ИЗ
	|	РегистрРасчета.Начисления.БазаНачисления(
	|			&ПарамИзмерения,
	|			&ПарамИзмерения,
	|			&ПарамРазрезы,
	|			ВидРасчета В (&МассивВРДляРаспределения)
	|				И Организация = &Организация
	|				И (ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И Результат <> 0) КАК НачисленияБазаНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО НачисленияБазаНачисления.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	КадровыеДанныеСотрудников.ВидДоговора В (&МассивВидыДоговоров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.РегистраторВР
	|ПОМЕСТИТЬ ВТСторнировавшиеДокументы
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|ГДЕ
	|	ПромежуточныеДанные.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныеДанные.Сотрудник,
	|	ПромежуточныеДанные.Период,
	|	ПромежуточныеДанные.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ПромежуточныеДанные.РегистраторВР В
	|				(ВЫБРАТЬ
	|					СторнировавшиеДокументы.РегистраторВР
	|				ИЗ
	|					ВТСторнировавшиеДокументы КАК СторнировавшиеДокументы)
	|			ТОГДА ПромежуточныеДанные.РегистраторВР
	|		ИНАЧЕ ПромежуточныеДанные.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ПромежуточныеДанные.Результат,
	|	ПромежуточныеДанные.ПериодВР,
	|	ПромежуточныеДанные.РегистраторВР,
	|	ПромежуточныеДанные.ВидРасчетаВР,
	|	ПромежуточныеДанные.РезультатВР
	|ПОМЕСТИТЬ ВТБаза
	|ИЗ
	|	ВТВРДляРаспределения КАК ПромежуточныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияВР.Регистратор КАК РегистраторВР,
	|	НачисленияВР.НомерСтроки КАК НомерСтрокиВР,
	|	НачисленияВР.Сумма КАК РезультатВР,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки,
	|	Начисления.Сумма КАК Результат
	|ИЗ
	|	ВТБаза КАК База
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияВР
	|		ПО (НачисленияВР.Регистратор = База.РегистраторВР)
	|			И (НачисленияВР.Период = База.ПериодВР)
	|			И (НачисленияВР.Сотрудник = База.Сотрудник)
	|			И (НачисленияВР.НачислениеУдержание = База.ВидРасчетаВР)
	|			И (НачисленияВР.Организация = &Организация)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ПО (Начисления.Регистратор = База.Регистратор)
	|			И (Начисления.Период = База.Период)
	|			И (Начисления.Сотрудник = База.Сотрудник)
	|			И (Начисления.НачислениеУдержание = База.ВидРасчета)
	|			И (Начисления.Организация = &Организация)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияВР.Регистратор,
	|	НачисленияВР.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРегистраторов = РегистрыРасчета.Начисления.СоздатьНаборЗаписей().ВыгрузитьКолонки("Регистратор");
	МассивТиповДокументов = Новый Массив;
	Для каждого ТипДокумента Из ТаблицаРегистраторов.Колонки.Регистратор.ТипЗначения.Типы() Цикл
		МассивТиповДокументов.Добавить(ТипДокумента);
	КонецЦикла;
	
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("Регистратор", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаРаспределения.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределения.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	
	ВремТаблица = ТаблицаРаспределения.СкопироватьКолонки();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РегистраторВР") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтрокиВР") Цикл
			
			СуммаКРаспределению = Выборка.РезультатВР;
			
			ВремТаблица.Очистить();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ВремТаблица.Добавить(),Выборка);
			КонецЦикла;
			
			МассивКоэффициентов = ВремТаблица.ВыгрузитьКолонку("Результат");
			МассивСуммКНачислению = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СуммаКРаспределению,МассивКоэффициентов);
			
			Если МассивСуммКНачислению <> Неопределено Тогда
				
				Для каждого СтрокаТЗ Из ВремТаблица Цикл
					
					НоваяСтрока = ТаблицаРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
					НоваяСтрока.Результат = МассивСуммКНачислению[ВремТаблица.Индекс(СтрокаТЗ)];
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	ТаблицаРаспределения.Свернуть("Регистратор,НомерСтроки","Результат");
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	
	МуниципальныеДолжности = Новый Массив;
	МуниципальныеДолжности.Добавить("МуниципальнаяДолжность");
	МуниципальныеДолжности.Добавить("ДолжностьМуниципальнойСлужбы");
	Запрос.УстановитьПараметр("МуниципальныеДолжности", МуниципальныеДолжности);
	
	МассивКОСГУ = Новый Массив;
	МассивКОСГУ.Добавить(ОтражениеЗарплатыВБухучетеРасширенный.СтатьяРасходов211());
	Запрос.УстановитьПараметр("КОСГУ", МассивКОСГУ);
	
	ПараметрыПолученияРабочихМест = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияРабочихМест,ПараметрыПолученияСотрудников);
	// Получаем рабочие места сотрудников
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияРабочихМест);
			
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Регистратор КАК Регистратор,
	|	ТаблицаРаспределения.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРаспределения.Результат
	|ПОМЕСТИТЬ ВТТаблицаРаспределения
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Должность,
	|	ЕСТЬNULL(СтрокиОтчетностиРасходовИЧисленности.СтрокаОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов.КодКатегорииПерсонала,"""") КАК КодКатегорииПерсонала,
	|	СвойстваДолжностейГосударственнойСлужбы.ГруппаДолжностиГосударственнойСлужбы
	|ПОМЕСТИТЬ ВТДвиженияРаботников
	|ИЗ
	|	ВТРабочиеМестаСотрудников КАК РаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов КАК СтрокиОтчетностиРасходовИЧисленности
	|		ПО (СтрокиОтчетностиРасходовИЧисленности.Должность = РаботникиОрганизации.Должность)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейГосударственнойСлужбы КАК СвойстваДолжностейГосударственнойСлужбы
	|		ПО (СвойстваДолжностейГосударственнойСлужбы.Должность = РаботникиОрганизации.Должность)
	|ГДЕ
	|	РаботникиОрганизации.Организация = &Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(Начисления.Период, МЕСЯЦ) КАК Период,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.НачислениеУдержание КАК ВидРасчета,
	|	СвойстваНачисленийГосударственныхСлужащих.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,
	|	Начисления.СтатьяФинансирования,
	|	Начисления.Сумма КАК Результат,
	|	Начисления.Регистратор,
	|	Начисления.НомерСтроки
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваНачисленийГосударственныхСлужащих КАК СвойстваНачисленийГосударственныхСлужащих
	|		ПО СвойстваНачисленийГосударственныхСлужащих.Начисление = Начисления.НачислениеУдержание	
	|ГДЕ
	|	Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|	И Начисления.Организация = &Организация
	|	И Начисления.СтатьяРасходов В(&КОСГУ)
	|	И Начисления.Сумма <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.Сотрудник КАК Сотрудник,
	|	ТаблицаНачислений.Период КАК Период,
	|	МАКСИМУМ(ВТДвиженияРаботников.Период) КАК ПериодДвижения
	|ПОМЕСТИТЬ ВТДвиженияНачисления
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|			И (ВТДвиженияРаботников.Период <= ТаблицаНачислений.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаНачислений.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)) КАК КБК,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию КАК ОтношениеКДенежномуСодержанию,	
	|	ЕСТЬNULL(ВТДвиженияРаботников.КодКатегорииПерсонала, """") КАК КодКатегорииПерсонала,
	|	ЕСТЬNULL(ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы, ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.ПустаяСсылка)) КАК ГруппаДолжности,
	|	СУММА(ТаблицаНачислений.Результат + ЕСТЬNULL(ВТТаблицаРаспределения.Результат, 0)) КАК Результат
	|ПОМЕСТИТЬ ВТДанныеУчета
	|ИЗ
	|	ВТНачисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияНачисления КАК ВТДвиженияНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ВТДвиженияРаботников
	|			ПО ВТДвиженияНачисления.Сотрудник = ВТДвиженияРаботников.Сотрудник
	|				И ВТДвиженияНачисления.ПериодДвижения = ВТДвиженияРаботников.Период
	|		ПО ТаблицаНачислений.Сотрудник = ВТДвиженияНачисления.Сотрудник
	|			И ТаблицаНачислений.Период = ВТДвиженияНачисления.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаРаспределения КАК ВТТаблицаРаспределения
	|		ПО ТаблицаНачислений.Регистратор = ВТТаблицаРаспределения.Регистратор
	|			И ТаблицаНачислений.НомерСтроки = ВТТаблицаРаспределения.НомерСтроки
	|			И (ВТДвиженияРаботников.КодКатегорииПерсонала В (&МуниципальныеДолжности))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТДвиженияРаботников.КодКатегорииПерсонала В (&МуниципальныеДолжности)
	|					И ТаблицаНачислений.ВидРасчета В (&МассивВРДляРаспределения)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДвиженияРаботников.ГруппаДолжностиГосударственнойСлужбы,
	|	ТаблицаНачислений.ОтношениеКДенежномуСодержанию,
	|	ВТДвиженияРаботников.КодКатегорииПерсонала,
	|	ТаблицаНачислений.СтатьяФинансирования,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчета.КБК,
	|	СУММА(ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012) КАК Раздел1_СТР010,
	|	СУММА(ДанныеУчета.Раздел1_СТР011) КАК Раздел1_СТР011,
	|	СУММА(ДанныеУчета.Раздел1_СТР012) КАК Раздел1_СТР012,
	|	СУММА(ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР022 + ДанныеУчета.Раздел1_СТР024) КАК Раздел1_СТР020,
	|	СУММА(ДанныеУчета.Раздел1_СТР021) КАК Раздел1_СТР021,
	|	СУММА(ДанныеУчета.Раздел1_СТР022) КАК Раздел1_СТР022,
	|	СУММА(ДанныеУчета.Раздел1_СТР023) КАК Раздел1_СТР023,
	|	СУММА(ДанныеУчета.Раздел1_СТР024) КАК Раздел1_СТР024,
	|	СУММА(ДанныеУчета.Раздел1_СТР030) КАК Раздел1_СТР030,
	|	СУММА(ДанныеУчета.Раздел1_СТР040) КАК Раздел1_СТР040,
	|	СУММА(ДанныеУчета.Раздел1_СТР011 + ДанныеУчета.Раздел1_СТР012 + ДанныеУчета.Раздел1_СТР021 + ДанныеУчета.Раздел1_СТР022 + ДанныеУчета.Раздел1_СТР024 + ДанныеУчета.Раздел1_СТР030 + ДанныеУчета.Раздел1_СТР040) КАК Раздел1_СТР050,
	|	СУММА(ДанныеУчета.Раздел3_СТР410 + ДанныеУчета.Раздел3_СТР420 + ДанныеУчета.Раздел3_СТР430 + ДанныеУчета.Раздел3_СТР440 + ДанныеУчета.Раздел3_СТР450) КАК Раздел3_СТР400,
	|	СУММА(ДанныеУчета.Раздел3_СТР410) КАК Раздел3_СТР410,
	|	СУММА(ДанныеУчета.Раздел3_СТР420) КАК Раздел3_СТР420,
	|	СУММА(ДанныеУчета.Раздел3_СТР430) КАК Раздел3_СТР430,
	|	СУММА(ДанныеУчета.Раздел3_СТР440) КАК Раздел3_СТР440,
	|	СУММА(ДанныеУчета.Раздел3_СТР450) КАК Раздел3_СТР450
	|ИЗ
	|	(ВЫБРАТЬ
	|		Данные.КБК КАК КБК,
	|		СУММА(ВЫБОР
	|				КОГДА  Данные.КодКатегорииПерсонала В (""МуниципальнаяДолжность"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка011Исключения))
	|						И Данные.ОтношениеКДенежномуСодержанию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР011,
	|		СУММА(ВЫБОР
	|				КОГДА  Данные.КодКатегорииПерсонала В (""МуниципальнаяДолжность"")
	|						И (Данные.ОтношениеКДенежномуСодержанию В (&Строка012)
	|							ИЛИ Данные.ОтношениеКДенежномуСодержанию = ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка))
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР012,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка021)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР021,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка022Исключения))
	|						И Данные.ОтношениеКДенежномуСодержанию <> ЗНАЧЕНИЕ(Перечисление.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР022,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка023)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР023,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И Данные.ОтношениеКДенежномуСодержанию В (&Строка024)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР024,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""НеЯвляетсяДолжностьюМуниципальнойСлужбы"")
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР030,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""МуниципальнаяДолжностьНовойСистемыОплатыТруда"")
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел1_СТР040,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка024))
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР410,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка024))
	|						И Данные.ГруппаДолжности =  ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР420,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка024))
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР430,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка024))
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР440,
	|		СУММА(ВЫБОР
	|				КОГДА Данные.КодКатегорииПерсонала В (""ДолжностьМуниципальнойСлужбы"")
	|						И (НЕ Данные.ОтношениеКДенежномуСодержанию В (&Строка024))
	|						И Данные.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|					ТОГДА Данные.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Раздел3_СТР450
	|	ИЗ
	|		ВТДанныеУчета КАК Данные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Данные.КБК) КАК ДанныеУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчета.КБК";

	
	Строка011Исключения = Новый СписокЗначений;
	Строка011Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строка011Исключения", Строка011Исключения);
	
 	Строка012 = Новый СписокЗначений;
	Строка012.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строка012", Строка012);
	
 	Строка021 = Новый СписокЗначений;
	Строка021.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Запрос.УстановитьПараметр("Строка021", Строка021);
	
 	Строка022Исключения = Новый СписокЗначений;
	Строка022Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ДолжностнойОклад);
	Строка022Исключения.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Запрос.УстановитьПараметр("Строка022Исключения", Строка022Исключения);
	
 	Строка023 = Новый СписокЗначений;
	Строка023.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЕжемесячноеДенежноеПоощрение);
	Запрос.УстановитьПараметр("Строка023", Строка023);
	
 	Строка024 = Новый СписокЗначений;
	Строка024.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПрочиеВыплаты);
	Строка024.Добавить(Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ПустаяСсылка());
	Запрос.УстановитьПараметр("Строка024", Строка024);
			
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДанных.Расходы = РезультатЗапроса.Выбрать();
	
	СтруктураДанных.Справка = СтруктураДанных.Расходы;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеПоФорме14МОЧисленность(Организация, ДатаНачала, ДатаОкончания) экспорт 
	
	ТаблицаДанныхОтчета = Новый ТаблицаЗначений;
	ТаблицаДанныхОтчета.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаДанныхОтчета.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КодКатегорииПерсонала", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТаблицаДанныхОтчета.Колонки.Добавить("ГруппаДолжности", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыДолжностейГосударственнойСлужбы"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КоличествоСтавок", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("КоличествоЗанятыхСтавок", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СписочнаяЧисленность", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СписочнаяЧисленностьНаКонецПериода", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СреднесписочнаяЧисленность", Новый ОписаниеТипов("Число"));
	ТаблицаДанныхОтчета.Колонки.Добавить("СреднесписочнаяЧисленностьЗаПериод", Новый ОписаниеТипов("Число"));
		
	СтруктураЧисленности = СтатистикаПерсоналаРасширенный.СведенияОДолжностяхИЧисленностиРегламентированнойОтчетности(Организация, ДатаНачала, ДатаОкончания);
	
	
	СтрокаОрганизации = СтруктураЧисленности.ДанныеШтатногоРасписания.Строки.Найти(Организация, "Организация");
	Если СтрокаОрганизации <> Неопределено Тогда
		Для Каждого СтрокаЧисленности Из СтрокаОрганизации.Строки Цикл
	   		НоваяСтрокаОтчета = ТаблицаДанныхОтчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОтчета,СтрокаЧисленности);
			НоваяСтрокаОтчета.КодКатегорииПерсонала = СтрокаЧисленности.Должность_СтрокаОтчетностиФормы14_КодКатегорииПерсонала;
			НоваяСтрокаОтчета.ГруппаДолжности 		= СтрокаЧисленности.Должность_ГруппаДолжности_;
		КонецЦикла;	
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Подразделение,Должность");
	СтрокаОрганизации = СтруктураЧисленности.ДанныеСреднесписочнойЧисленности.Строки.Найти(Организация, "Организация");
	Если СтрокаОрганизации <> Неопределено Тогда
		Для Каждого СтрокаЧисленности Из СтрокаОрганизации.Строки Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаЧисленности);
			ПозицииШтатногоРасписания = ТаблицаДанныхОтчета.НайтиСтроки(СтруктураПоиска);
			Если ПозицииШтатногоРасписания.Количество() > 0 Тогда
				СтрокаШР = ПозицииШтатногоРасписания[0];
				СтрокаШР.СписочнаяЧисленность 				= СтрокаШР.СписочнаяЧисленность + СтрокаЧисленности.ЧисленностьСписочногоСостава;
				СтрокаШР.СписочнаяЧисленностьНаКонецПериода = СтрокаШР.СписочнаяЧисленностьНаКонецПериода + СтрокаЧисленности.ЧисленностьНаКонецПериодаСписочногоСостава;
				СтрокаШР.СреднесписочнаяЧисленность 		= СтрокаШР.СреднесписочнаяЧисленность + СтрокаЧисленности.СредняяЧисленностьСписочногоСостава;
				СтрокаШР.СреднесписочнаяЧисленностьЗаПериод = СтрокаШР.СреднесписочнаяЧисленностьЗаПериод + СтрокаЧисленности.СредняяЧисленностьЗаПериодСписочногоСостава;
			Иначе
				СтрокаШР = ТаблицаДанныхОтчета.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаШР,СтрокаЧисленности);
				СтрокаШР.КодКатегорииПерсонала 	= СтрокаЧисленности.Должность_СтрокаОтчетностиФормы14_КодКатегорииПерсонала;
				СтрокаШР.ГруппаДолжности 		= СтрокаЧисленности.Должность_ГруппаДолжности_;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	ТаблицаДанныхОтчета.Свернуть("СтатьяФинансирования,КодКатегорииПерсонала,ГруппаДолжности","КоличествоСтавок,СписочнаяЧисленностьНаКонецПериода,СреднесписочнаяЧисленностьЗаПериод,СреднесписочнаяЧисленность,СреднесписочнаяЧисленностьЗаПериод");
	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаДанныхОтчета", ТаблицаДанныхОтчета);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанныхОтчета.СтатьяФинансирования,
	|	ТаблицаДанныхОтчета.КодКатегорииПерсонала,
	|	ТаблицаДанныхОтчета.ГруппаДолжности,
	|	ТаблицаДанныхОтчета.КоличествоСтавок,
	|	ТаблицаДанныхОтчета.СписочнаяЧисленностьНаКонецПериода,
	|	ТаблицаДанныхОтчета.СреднесписочнаяЧисленность КАК Среднесписочная
	|ПОМЕСТИТЬ ВТТаблицаДанныхОтчета
	|ИЗ &ТаблицаДанныхОтчета КАК ТаблицаДанныхОтчета
	|;	
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.КоличествоСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр1,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.СписочнаяЧисленностьНаКонецПериода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр2,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|					ИЛИ ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР290Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжность""
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР200Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР210Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Высшие)
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР220Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Главные)
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР230Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Ведущие)
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР240Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Старшие)
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР250Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""ДолжностьМуниципальнойСлужбы""
	|					И ДолжностиОрганизаций.ГруппаДолжности = ЗНАЧЕНИЕ(Перечисление.ГруппыДолжностейГосударственнойСлужбы.Младшие)
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР260Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""НеЯвляетсяДолжностьюМуниципальнойСлужбы""
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР270Гр3,
	|	СУММА(ВЫБОР
	|			КОГДА ДолжностиОрганизаций.КодКатегорииПерсонала = ""МуниципальнаяДолжностьНовойСистемыОплатыТруда""
	|				ТОГДА ДолжностиОрганизаций.Среднесписочная
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Раздел2_СТР280Гр3,	
	|	ЕСТЬNULL(ДолжностиОрганизаций.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка)) КАК КБК
	|ИЗ
	|	ВТТаблицаДанныхОтчета КАК ДолжностиОрганизаций
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ДолжностиОрганизаций.СтатьяФинансирования, ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка))";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

Процедура СформироватьОтчетФорма14МО(ТаблицаОтчета, Организация, ДатаНачала, ДатаОкончания)
	
	Точность = 4;
	
	Если ДатаОкончания >= ДатаПереходаНа259н() Тогда
		Макет = ПолучитьМакет("Форма14МО_по_259н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа86н() Тогда
		Макет = ПолучитьМакет("Форма14МО_по_86н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа143н() Тогда
		Макет = ПолучитьМакет("Форма14МО_по_143н")
	ИначеЕсли ДатаОкончания >= ДатаПереходаНа179н() Тогда
		Макет = ПолучитьМакет("Форма14МО_по_179н")
	Иначе	
		Макет = ПолучитьМакет("Форма14МО")
	КонецЕсли;
	
		
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Если Точность = 1 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Рубль";
	ИначеЕсли Точность = 4 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Тысяча рублей";
	ИначеЕсли Точность = 7 Тогда
		Шапка.Параметры.ЕдиницаИзмерения = "Миллион рублей";
	КонецЕсли;
	Шапка.Параметры.Организация = Организация.НаименованиеПолное;
	
	ТаблицаОтчета.Вывести(Шапка);
	
	СтруктураДанных = ПолучитьДанныеПоФорме14МОРасходы(Организация, ДатаНачала, ДатаОкончания);
	
	СтруктураДанных.Расходы.Сбросить();
	ВывестиРаздел(ТаблицаОтчета, СтруктураДанных.Расходы, 1, Точность-1, Макет);	
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВыборкаЧисленность = ПолучитьДанныеПоФорме14МОЧисленность(Организация, ДатаНачала, ДатаОкончания);
	ВывестиРаздел(ТаблицаОтчета, ВыборкаЧисленность, 2, 0, Макет);
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтруктураДанных.Расходы.Сбросить();
	ВывестиРаздел(ТаблицаОтчета, СтруктураДанных.Расходы, 3, Точность-1, Макет);	
	ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();	
	
	ТаблицаОтчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТаблицаОтчета.Автомасштаб        = Истина;
	ТаблицаОтчета.ПолеСлева          = 0;
	ТаблицаОтчета.ПолеСправа         = 0;
	ТаблицаОтчета.Защита             = Ложь;
	ТаблицаОтчета.ТолькоПросмотр     = Истина;	
	
КонецПроцедуры 


#КонецОбласти

#КонецЕсли
